Autodesk.Revit.DB.Structure.RebarShapeSegment.SetConstraints(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarShapeConstraint})
Assign a new list of constraints to this segment.
Remarks:
Any existing constraints are discarded. The new constraints replace them.
Any parameters driving the constraints must already be added
with RebarShapeDefinition.AddParameter().
The allowable constraint types are:
RebarShapeConstraintAngleFromFixedDirRebarShapeConstraintSegmentLengthRebarShapeConstraintFixedSegmentDirRebarShapeConstraintProjectedSegmentLengthRebarShapeConstraint180DegreeBendArcLengthRebarShapeConstraint180DegreeBendRadiusRebarShapeConstraint180DegreeDefaultBend
At least two independent constraints must be specified. Overconstraining
is supported. Constraints of type RebarShapeConstraintFixedSegmentDir must be unique.
constraints:
A new list of constraints.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more of the constraints is of a type not supported for RebarShapeSegment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeSegment.GetConstraints
Retrieve the list of constraints associated with this segment.
Returns:
The list of constraints.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeSegment.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarShapeSegment
Part of a RebarShapeDefinitionBySegments, representing one segment
of a shape definition.
Makes sure constraints of type RebarShapeConstraintFixedSegmentDir are uniquely set.
If we try to aquire a second constraint of type RebarShapeConstraintFixedSegmentDir we delete the old one.
Remarks:
Each segment must have enough constraints
to determine its position. Overconstraining is allowed.
The most common combinations are:
A fixed direction together with a parallel length constraint;  A parallel length constraint plus another length constraint parallel to the x-axis or y-axis;  A parallel length constraint plus length constraints parallel to both the x-axis and y-axis.
Multiple constraints may be driven by the same parameter, even on the same segment.
Length constraints may be measured in two ways.
For "measured to the outside of the bend," the reference is a tangent to the
exterior face of the bar; the thickness of the bar is included.
For "measured to the inside," the reference is the center of the arc of the bend;
this is the point where the bend begins, if the constraint is parallel to the segment.
A 180-degree bend is described by introducing a short segment in between the
two straight segments, tangent to the midpoint of the bend.
Since:
2012